/* 1. конвертер температуры */

var tempFar;
var tempCel = +prompt('Введите температуру в градусах Цельсия');
tempFar = (9 / 5) * tempCel + 32;
alert('Температура по фаренгейту: ' + tempFar);



/* 2. именуем админа */

var admin;
var name;
name = 'Василий';
admin = name;
alert(admin);

/* 3. сложение для разных типов данных */
/* 1000 + "108" - результат 1000108, строковый тип, конкатенация */



/* 4. разница в атрибутах async и defer 

async - загрузка асинхронна, выполнение без учета порядка.
defer - загрузка асинхронна, начало выполнения в порядке пересчиления в HTML документе.

*/


